HaLoTaRiS/robot-biere-okdo/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_LED_RED_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_LED_RED_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_LED_RED_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_LED_RED_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_LED_RED_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO1_7 (number 9), R79/P18[7]/LEDG/PWM_ARD
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_LED_GREEN_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_LED_GREEN_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_LED_GREEN_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_LED_GREEN_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_LED_GREEN_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO1_6 (number 5), R80/P18[9]/LEDB/PWM_ARD
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_LED_BLUE_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_LED_BLUE_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_LED_BLUE_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_LED_BLUE_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_LED_BLUE_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO0_23 (number 20), P19[4]/ADC0_P
  @{ */
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_A_STEP_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_A_STEP_PIN 23U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_A_STEP_PIN_MASK (1U << 23U)
/* @} */

/*! @name PIO0_16 (number 14), P19[2]/P23[1]/ADC0_N
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_ENABLE_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_ENABLE_GPIO_PIN_MASK (1U << 16U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_ENABLE_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_ENABLE_PIN 16U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_ENABLE_PIN_MASK (1U << 16U)
/* @} */

/*! @name PIO0_15 (number 22), P18[11]/PIO0_15_GPIO_ARD
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_A_DIRECTION_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_A_DIRECTION_GPIO_PIN_MASK (1U << 15U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_A_DIRECTION_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_A_DIRECTION_PIN 15U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_A_DIRECTION_PIN_MASK (1U << 15U)
/* @} */

/*! @name PIO1_27 (number 85), P17[16]/PLU_IN4/GPIO
  @{ */
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_B_STEP_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_B_STEP_PIN 27U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_B_STEP_PIN_MASK (1U << 27U)
/* @} */

/*! @name PIO1_26 (number 68), P18[18]/PLU_IN5/GPIO/SD1_WP
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_B_DIRECTION_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_B_DIRECTION_GPIO_PIN_MASK (1U << 26U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_B_DIRECTION_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_B_DIRECTION_PIN 26U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_B_DIRECTION_PIN_MASK (1U << 26U)
/* @} */

/*! @name PIO1_9 (number 10), S3/P18[1]/PIO1_9_GPIO_ARD
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ULTRASON_1_TRIG_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_ULTRASON_1_TRIG_GPIO_PIN_MASK (1U << 9U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ULTRASON_1_TRIG_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_ULTRASON_1_TRIG_PIN 9U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_ULTRASON_1_TRIG_PIN_MASK (1U << 9U)
/* @} */

/*! @name PIO0_7 (number 6), U20[4]/SD0_CLK
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_1_XSHUT_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_1_XSHUT_GPIO_PIN_MASK (1U << 7U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_1_XSHUT_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_1_XSHUT_PIN 7U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_1_XSHUT_PIN_MASK (1U << 7U)
/* @} */

/*! @name PIO1_0 (number 11), U20[2]/SD0_D3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_1_INT_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_1_INT_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_1_INT_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_1_INT_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_1_INT_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PIO0_31 (number 23), U20[1]/SD0_D2
  @{ */

