HaLoTaRiS/robot-biere-okdo/board/pin_mux.h
/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_2_XSHUT_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_2_XSHUT_GPIO_PIN_MASK (1U << 31U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_2_XSHUT_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_2_XSHUT_PIN 31U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_2_XSHUT_PIN_MASK (1U << 31U)
/* @} */

/*! @name PIO1_1 (number 59), P17[15]/P23[3]/LSPI_HS_SSEL1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_2_INT_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_2_INT_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_2_INT_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_2_INT_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_2_INT_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PIO1_2 (number 61), P17[9]/P23[4]/LSPI_HS_SCK
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_3_XSHUT_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_3_XSHUT_GPIO_PIN_MASK (1U << 2U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_3_XSHUT_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_3_XSHUT_PIN 2U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_3_XSHUT_PIN_MASK (1U << 2U)
/* @} */

/*! @name PIO1_3 (number 62), P17[11]/P23[5]/LSPI_HS_MISO
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_3_INT_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_3_INT_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_3_INT_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_3_INT_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_3_INT_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PIO1_5 (number 31), P17[17]/P24[1]/PIO1_5_GPIO_ARD
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_4_XSHUT_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_4_XSHUT_GPIO_PIN_MASK (1U << 5U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_4_XSHUT_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_4_XSHUT_PIN 5U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_4_XSHUT_PIN_MASK (1U << 5U)
/* @} */

/*! @name PIO1_8 (number 24), P17[19]/PIO1_8_GPIO_ARD
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_4_INT_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_4_INT_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_4_INT_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_4_INT_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_4_INT_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PIO0_5 (number 88), S1/J10[1]/U3[12]/P17[8]/P7[7]/U11[4]/P0_5-ISP1
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SWITCH_BOARD_1_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_SWITCH_BOARD_1_GPIO_PIN_MASK (1U << 5U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SWITCH_BOARD_1_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_SWITCH_BOARD_1_PIN 5U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_SWITCH_BOARD_1_PIN_MASK (1U << 5U)
/* @} */

/*! @name PIO1_31 (number 91), P19[7]/P19[8]/PLU_IN0/GPIO
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_PINCE_TX_Enable_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_PINCE_TX_Enable_GPIO_PIN_MASK (1U << 31U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_PINCE_TX_Enable_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_PINCE_TX_Enable_PIN 31U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_PINCE_TX_Enable_PIN_MASK (1U << 31U)
/* @} */

/*! @name PIO0_14 (number 72), P19[11]/P19[12]/U2[D6]/P20[6]/FC1_I2C_SCL
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ULTRASON_2_TRIG_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_ULTRASON_2_TRIG_GPIO_PIN_MASK (1U << 14U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ULTRASON_2_TRIG_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_ULTRASON_2_TRIG_PIN 14U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_ULTRASON_2_TRIG_PIN_MASK (1U << 14U)
/* @} */

/*! @name PIO0_13 (number 71), P19[9]/P19[10]/U2[E6]/P20[8]/FC1_I2C_SDA
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ULTRASON_2_ECHO_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_ULTRASON_2_ECHO_GPIO_PIN_MASK (1U << 13U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ULTRASON_2_ECHO_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_ULTRASON_2_ECHO_PIN 13U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_ULTRASON_2_ECHO_PIN_MASK (1U << 13U)
/* @} */

/*! @name PIO0_27 (number 27), P18[13]/P24[4]/FC2_USART_TXD_ARD
  @{ */
#define BOARD_INITDEBUG_UARTPINS_PINCE_TX_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_PINCE_TX_PIN 27U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_PINCE_TX_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

